<a href="https://colab.research.google.com/github/teddcp/pandas-notes/blob/master/Pandas_notes_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
data=pd.read_csv('titanic.csv')
data.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

# Setting the max-rows and max-columns in pandas
 <a href='https://stackoverflow.com/q/16424493/12210002'>link</a>
 
 Any attribute we can access it using **pd.options and set with set_option**

In [ ]:
pd.options.display.max_rows,pd.options.display.min_rows

(60, 10)

In [ ]:
pd.set_option('display.min_rows',20)

In [ ]:
data

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
5           0       3    male   NaN      0      0   8.4583        Q  NaN
6           0       1    male  54.0      0      0  51.8625        S    E
7           0       3    male   2.0      3      1  21.0750        S  NaN
8           1       3  female  27.0      0      2  11.1333        S  NaN
9           1       2  female  14.0      1      0  30.0708        C  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
881         0       3    male  33.0      0      0   7.8958        S  NaN
882         0       3  female  22.0      0      0  10.5167        S  NaN
883         0       2    male  28.0      0      0  10.5000        S  NaN
884         0       3    male  25.0      0      0   7.0500        S  NaN
885         0       3  female  39.0      0      5  29.1250        Q  NaN
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [ ]:
pd.reset_option('all')  #resetting 
data                    #back to normal

: boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.

d:\application\python\lib\site-packages\pandas\_config\config.py:620: FutureWarning:
: boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.

  warnings.warn(d.msg, FutureWarning)

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

# Inspecting the data
<a href='https://stackoverflow.com/a/34466473/12210002'>describe()</a>

In [ ]:
data.info()
#we can get the data type and numbe rof null values from this
# https://stackoverflow.com/a/60748009/12210002

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  891 non-null    int64
 1   pclass    891 non-null    int64
 2   sex       891 non-null    object
 3   age       714 non-null    float64
 4   sibsp     891 non-null    int64
 5   parch     891 non-null    int64
 6   fare      891 non-null    float64
 7   embarked  889 non-null    object
 8   deck      203 non-null    object
dtypes: float64(2), int64(4), object(3)
memory usage: 62.8+ KB

In [ ]:
data.describe()  #it may not show all the columns of the data, 

#to get all the columns --->  data.describe(include='all')

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
data.describe(include='all')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,203
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,7
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,C
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,59
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN

In [ ]:
#to get the string columns info
data.describe(include=['O'])  # O means object

         sex embarked deck
count    891      889  203
unique     2        3    7
top     male        S    C
freq     577      644   59

In [ ]:
data.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

DataFrame Attributes
====================

In [ ]:
len(data)

891

In [ ]:
data.shape

(891, 9)

In [ ]:
data.size

8019

In [ ]:
data.index       #to get the row labels

RangeIndex(start=0, stop=891, step=1)

In [ ]:
data.columns    #to get the column labels

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'deck'],
      dtype='object')

# DataFrame methods

In [ ]:
data.min()  #to get the min values column wise

survived         0
pclass           1
sex         female
age           0.42
sibsp            0
parch            0
fare             0
dtype: object

In [ ]:
data.sum(numeric_only=True)

survived      342.0000
pclass       2057.0000
age         21205.1700
sibsp         466.0000
parch         340.0000
fare        28693.9493
dtype: float64

In [ ]:
data.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
data.set_index('survived',inplace=True)
data.sort_index()  #sorting the index

          pclass     sex   age  sibsp  parch      fare embarked deck
survived
0              3    male  22.0      1      0    7.2500        S  NaN
0              3    male  32.0      0      0    7.8958        S  NaN
0              3    male  22.0      0      0    7.8958        S  NaN
0              3    male   NaN      0      0    7.2250        C  NaN
0              3    male   NaN      0      0    7.2292        C  NaN
...          ...     ...   ...    ...    ...       ...      ...  ...
1              2  female  19.0      1      0   26.0000        S  NaN
1              1  female  31.0      1      0  113.2750        C    D
1              3  female  27.0      0      0    7.9250        S  NaN
1              1  female  32.0      0      0   76.2917        C    D
1              1    male   4.0      0      2   81.8583        S    A

[891 rows x 8 columns]

In [ ]:
data.reset_index(inplace=True)

In [ ]:
data.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [ ]:
data.sort_values(by='age')  #by =[multiple,columns], ascending=False, inplace

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
803         1       3    male  0.42      0      1   8.5167        C  NaN
755         1       2    male  0.67      1      1  14.5000        S  NaN
644         1       3  female  0.75      2      1  19.2583        C  NaN
469         1       3  female  0.75      2      1  19.2583        C  NaN
78          1       2    male  0.83      0      2  29.0000        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
859         0       3    male   NaN      0      0   7.2292        C  NaN
863         0       3  female   NaN      8      2  69.5500        S  NaN
868         0       3    male   NaN      0      0   9.5000        S  NaN
878         0       3    male   NaN      0      0   7.8958        S  NaN
888         0       3  female   NaN      1      2  23.4500        S  NaN

[891 rows x 9 columns]

# selecting columns

In [ ]:
data.age, type(data.age)  #returns series

(0      22.0
 1      38.0
 2      26.0
 3      35.0
 4      35.0
        ...
 886    27.0
 887    19.0
 888     NaN
 889    26.0
 890    32.0
 Name: age, Length: 891, dtype: float64,
 pandas.core.series.Series)

In [ ]:
#multiple columns
data[['age','sex']]

      age     sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [ ]:
#checking the equality
data['age'].equals(data.age)

True

# Accessing rows : position based indexing (iloc)

In [ ]:
#accessing single row
data.iloc[0],'**************',data.iloc[-1]

(survived       0
 pclass         3
 sex         male
 age           22
 sibsp          1
 parch          0
 fare        7.25
 embarked       S
 deck         NaN
 Name: 0, dtype: object,
 '**************',
 survived       0
 pclass         3
 sex         male
 age           32
 sibsp          0
 parch          0
 fare        7.75
 embarked       Q
 deck         NaN
 Name: 890, dtype: object)

In [ ]:
#Accessing multiple rows
data.iloc[[1,3,100]]

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
1           1       1  female  38.0      1      0  71.2833        C    C
3           1       1  female  35.0      1      0  53.1000        S    C
100         0       3  female  28.0      0      0   7.8958        S  NaN

In [ ]:
# mixing rows with columns
data.iloc[:,[0,2,-1]]

     survived     sex deck
0           0    male  NaN
1           1  female    C
2           1  female  NaN
3           1  female    C
4           0    male  NaN
..        ...     ...  ...
886         0    male  NaN
887         1  female    B
888         0  female  NaN
889         1    male    C
890         0    male  NaN

[891 rows x 3 columns]

In [ ]:
data.iloc[1:3,1:3]   # does not include the last index

   pclass     sex
1       1  female
2       3  female

# Accessing rows : Label based indexing (loc)

In [ ]:
data.set_index('pclass',inplace=True)

In [ ]:
summer.loc["DRIVAS, Dimitrios"] #particular row

Year                                1896
City                              Athens
Sport                           Aquatics
Discipline                      Swimming
Country                              GRE
Gender                               Men
Event         100M Freestyle For Sailors
Medal                             Bronze
Name: DRIVAS, Dimitrios, dtype: object

In [ ]:
summer = pd.read_csv("summer.csv", index_col = "Athlete")
summer.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.loc[['HAJOS, Alfred','MALOKINIS, Ioannis'],'City':'Country']  #last item is included

                      City     Sport Discipline Country
Athlete
HAJOS, Alfred       Athens  Aquatics   Swimming     HUN
HAJOS, Alfred       Athens  Aquatics   Swimming     HUN
MALOKINIS, Ioannis  Athens  Aquatics   Swimming     GRE

In [ ]:
summer.loc['HERSCHMANN, Otto':'MALOKINIS, Ioannis',['City','Country']]  

#row label has to be unique in order to do slice operation

KeyError: "Cannot get left slice bound for non-unique label: 'HERSCHMANN, Otto'"

# reindex() 
======================

Reindex is useful whenever we dont have that row/column, but we want it inour dataframe, then it will append that row/column
with that particular value. If we try that with loc/iloc, then it will raise KEY ERROR

        df.reindex(index=[],columns=[])
        
<a href='https://chrisalbon.com/python/data_wrangling/pandas_dataframe_reindexing/'>reindex()</a>

In [ ]:
summer.index.unique

<bound method Index.unique of Index(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios',
       'MALOKINIS, Ioannis', 'CHASAPIS, Spiridon', 'CHOROPHAS, Efstathios',
       'HAJOS, Alfred', 'ANDREOU, Joannis', 'CHOROPHAS, Efstathios',
       'NEUMANN, Paul',
       ...
       'AHMADOV, Emin', 'KAZAKEVIC, Aleksandr', 'KHUGAEV, Alan',
       'EBRAHIM, Karam Mohamed Gaber', 'GAJIYEV, Danyal', 'JANIKOWSKI, Damian',
       'REZAEI, Ghasem Gholamreza', 'TOTROV, Rustam', 'ALEKSANYAN, Artur',
       'LIDBERG, Jimmy'],
      dtype='object', name='Athlete', length=31165)>

In [ ]:
summer.reindex(columns=['Age','sex'])  #creates a age column

                           Age  sex
Athlete
HAJOS, Alfred              NaN  NaN
HERSCHMANN, Otto           NaN  NaN
DRIVAS, Dimitrios          NaN  NaN
MALOKINIS, Ioannis         NaN  NaN
CHASAPIS, Spiridon         NaN  NaN
...                        ...  ...
JANIKOWSKI, Damian         NaN  NaN
REZAEI, Ghasem Gholamreza  NaN  NaN
TOTROV, Rustam             NaN  NaN
ALEKSANYAN, Artur          NaN  NaN
LIDBERG, Jimmy             NaN  NaN

[31165 rows x 2 columns]

In [ ]:
summer.reindex(columns=['Age'],fill_value=50)  #instead of NaN, it fills with 50

                           Age
Athlete
HAJOS, Alfred               50
HERSCHMANN, Otto            50
DRIVAS, Dimitrios           50
MALOKINIS, Ioannis          50
CHASAPIS, Spiridon          50
...                        ...
JANIKOWSKI, Damian          50
REZAEI, Ghasem Gholamreza   50
TOTROV, Rustam              50
ALEKSANYAN, Artur           50
LIDBERG, Jimmy              50

[31165 rows x 1 columns]

In [ ]:
summer.reset_index(inplace=True)

In [ ]:
summer.reindex(index=[2,100,200,31164,50000],columns=['background','Gender','Athlete'])  #creates a new values with NaN

       background Gender            Athlete
2             NaN    Men  DRIVAS, Dimitrios
100           NaN    Men     FLATOW, Alfred
200           NaN    Men        KEMP, Peter
31164         NaN    Men     LIDBERG, Jimmy
50000         NaN    NaN                NaN

In [ ]:
col=summer.columns[:3].to_list() + ["Gender", "Event"]
col

['Athlete', 'Year', 'City', 'Gender', 'Event']

In [ ]:
summer.columns

Index(['Athlete', 'Year', 'City', 'Sport', 'Discipline', 'Country', 'Gender',
       'Event', 'Medal'],
      dtype='object')

In [ ]:
summer.loc[:,col]

,Athlete,Year,City,Gender,Event
0,"HAJOS, Alfred",1896,Athens,Men,100M Freestyle
1,"HERSCHMANN, Otto",1896,Athens,Men,100M Freestyle
2,"DRIVAS, Dimitrios",1896,Athens,Men,100M Freestyle For Sailors
3,"MALOKINIS, Ioannis",1896,Athens,Men,100M Freestyle For Sailors
4,"CHASAPIS, Spiridon",1896,Athens,Men,100M Freestyle For Sailors
...,...,...,...,...,...
31160,"JANIKOWSKI, Damian",2012,London,Men,Wg 84 KG
31161,"REZAEI, Ghasem Gholamreza",2012,London,Men,Wg 96 KG
31162,"TOTROV, Rustam",2012,London,Men,Wg 96 KG
31163,"ALEKSANYAN, Artur",2012,London,Men,Wg 96 KG
31164,"LIDBERG, Jimmy",2012,London,Men,Wg 96 KG

--------------------------------------------------------------
# 2.  Index object in pandas
------------------------------------------------------------------

In [ ]:
summer.head(2)

,Athlete,Year,City,Sport,Discipline,Country,Gender,Event,Medal
0,"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver

In [ ]:
summer.index,type(summer.index)

(RangeIndex(start=0, stop=31165, step=1), pandas.core.indexes.range.RangeIndex)

In [ ]:
summer.columns,type(summer.columns)

(Index(['Athlete', 'Year', 'City', 'Sport', 'Discipline', 'Country', 'Gender',
        'Event', 'Medal'],
       dtype='object'),
 pandas.core.indexes.base.Index)

In [ ]:
summer.axes  #both axis 0 and 1 index labels

[RangeIndex(start=0, stop=31165, step=1),
 Index(['Athlete', 'Year', 'City', 'Sport', 'Discipline', 'Country', 'Gender',
        'Event', 'Medal'],
       dtype='object')]

In [ ]:
summer.columns[0],summer.columns[-1],summer.columns[2:6]

('Athlete',
 'Medal',
 Index(['City', 'Sport', 'Discipline', 'Country'], dtype='object'))

In [ ]:
summer.columns.to_list()

['Athlete',
 'Year',
 'City',
 'Sport',
 'Discipline',
 'Country',
 'Gender',
 'Event',
 'Medal']

In [ ]:
summer.columns.is_unique

True

In [ ]:
summer.index.is_unique   #wheather any duplicate names are there or not

True

In [ ]:
summer.index.get_loc(31160)

31160

## creating index object

In [ ]:
l1=[1,2,3]
l2=['xx','yy','zz']

index1=pd.Index(l1)
index2=pd.Index(l2)

index1,index2

(Int64Index([1, 2, 3], dtype='int64'),
 Index(['xx', 'yy', 'zz'], dtype='object'))

In [ ]:
pd.Index(range(1,3))

RangeIndex(start=1, stop=3, step=1)

In [ ]:
pd.Series(['deba','sita','Rama'],index=index1)  #making series with index

1    deba
2    sita
3    Rama
dtype: object

## changing row labels

In [ ]:
summer.set_index('Athlete',inplace=True)  #drop is true default

In [ ]:
summer.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.reset_index(inplace=True) #drop is false

In [ ]:
summer.head()

,Athlete,Year,City,Sport,Discipline,Country,Gender,Event,Medal
0,"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
2,"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
3,"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
4,"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.index[2]='Tedd CP'  #inside index list, mutable objects are there

TypeError: Index does not support mutable operations

In [ ]:
summer.index.size

31165

In [ ]:
summer.index.name='index'   #naming the index
summer.head()

,Athlete,Year,City,Sport,Discipline,Country,Gender,Event,Medal
index,,,,,,,,,
0,"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
2,"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
3,"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
4,"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
new_index = ["Medal_No{}".format(i) for i in range(1,summer.index.size+1)]
summer.index=new_index                   ####### Chaning the index names with an entire list

In [ ]:
summer.head(2)

coloumn_names,Year,City,Sport,Discipline,Country,SEX,Event,Medal
Medal_No1,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
Medal_No2,1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver

In [ ]:
# same goes for columns
# You cant change a single column name , but you can change the whole column names by assigning
# same size of new names

# we can assign a name to the columns

## changing the column labels

In [ ]:
summer.columns,summer.columns.size

(Index(['Year', 'City', 'Sport', 'Discipline', 'Country', 'SEX', 'Event',
        'Medal'],
       dtype='object', name='coloumn_names'),
 8)

In [ ]:
summer.columns[0]='dddd'   #it is also mutable

TypeError: Index does not support mutable operations

In [ ]:
summer.columns=['Yr','City','Sport','Discipline','Country','Gender','Event','Meda']  #changing the column labels
summer.head()

,Yr,City,Sport,Discipline,Country,Gender,Event,Meda
Medal_No1,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
Medal_No2,1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
Medal_No3,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
Medal_No4,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
Medal_No5,1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.columns.name='coloumn_names'
summer.head(2)

coloumn_names,Athlete,Year,City,Sport,Discipline,Country,Gender,Event,Medal
index,,,,,,,,,
0,"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
1,"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver

## renaming the index and column data

In [ ]:
summer.set_index('Athlete',inplace=True)

In [ ]:
summer.rename(index={'HAJOS, Alfred':'TEDD'},inplace=True)   #chaning tthe row content

In [ ]:
summer.head()

coloumn_names,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
TEDD,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [ ]:
summer.rename(columns={'Gender':'SEX'},inplace=True)
summer.head(2)

coloumn_names,Year,City,Sport,Discipline,Country,SEX,Event,Medal
Athlete,,,,,,,,
TEDD,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver

In [ ]:
summer.index.isnull()

array([False, False, False, ..., False, False, False])

In [ ]:
summer.index.isna()  #sanme as isnull

array([False, False, False, ..., False, False, False])

**<a href='https://stackoverflow.com/q/52086574/12210002'>isna() vs isnull()</a>** and **<a href='https://datascience.stackexchange.com/q/37878/94070'>isna() vs isnull()</a>**

---------------------------------------------------
# 3. Series object in pandas
-----------------------------------------------------

In [ ]:
summer.head(2)

,Yr,City,Sport,Discipline,Country,Gender,Event,Meda
Medal_No1,1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
Medal_No2,1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver

In [ ]:
sport=summer['Sport']
sport.head(),type(sport)

(Medal_No1    Aquatics
 Medal_No2    Aquatics
 Medal_No3    Aquatics
 Medal_No4    Aquatics
 Medal_No5    Aquatics
 Name: Sport, dtype: object,
 pandas.core.series.Series)

In [ ]:
len(sport),sport.shape

(31165, (31165,))

In [ ]:
sport.index

Index(['Medal_No1', 'Medal_No2', 'Medal_No3', 'Medal_No4', 'Medal_No5',
       'Medal_No6', 'Medal_No7', 'Medal_No8', 'Medal_No9', 'Medal_No10',
       ...
       'Medal_No31156', 'Medal_No31157', 'Medal_No31158', 'Medal_No31159',
       'Medal_No31160', 'Medal_No31161', 'Medal_No31162', 'Medal_No31163',
       'Medal_No31164', 'Medal_No31165'],
      dtype='object', length=31165)

### Converting series to dataframe

In [ ]:
sport.to_frame()

                   Sport
Medal_No1       Aquatics
Medal_No2       Aquatics
Medal_No3       Aquatics
Medal_No4       Aquatics
Medal_No5       Aquatics
...                  ...
Medal_No31161  Wrestling
Medal_No31162  Wrestling
Medal_No31163  Wrestling
Medal_No31164  Wrestling
Medal_No31165  Wrestling

[31165 rows x 1 columns]

In [ ]:
#now we can apply dataframe methods
sport.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
Index: 31165 entries, Medal_No1 to Medal_No31165
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sport   31165 non-null  object
dtypes: object(1)
memory usage: 1.7+ MB

In [ ]:
#data.head()
age=data['age']
age.head(2)

pclass
3    22.0
1    38.0
Name: age, dtype: float64

## Analyzing numerical series [Numerical column]

In [ ]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [ ]:
age.count()  #count non-null/na values

714

In [ ]:
len(age)

891

In [ ]:
age.sum()  #skips the na values by skipna

21205.17

In [ ]:
#mean, median, std. deviation, mode, minium and maxium
age.mean(),age.median(),age.std(),age.mode(),age.min(),age.max()

(29.69911764705882,
 28.0,
 14.526497332334042,
 0    24.0
 dtype: float64,
 0.42,
 80.0)

In [ ]:
age.unique(),len(age.unique())  #counts all the unique values includes null/na values

(array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
         4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
         8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
        49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
        16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
        71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
        51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
        45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
        60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
        70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ]),
 89)

In [ ]:
age.nunique()  # excludes null values with the unique by 'dropna' attribute

88

In [ ]:
age.value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [ ]:
age.value_counts(sort=True,ascending=False,dropna=False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
66.00      1
23.50      1
0.42       1
Name: age, Length: 89, dtype: int64

In [ ]:
age.value_counts(sort=True,ascending=False,dropna=True)

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64

In [ ]:
age.value_counts(sort=True,ascending=False,dropna=True,normalize=True) #brings the values between 0 and 1

24.00    0.042017
22.00    0.037815
18.00    0.036415
19.00    0.035014
30.00    0.035014
           ...
55.50    0.001401
70.50    0.001401
66.00    0.001401
23.50    0.001401
0.42     0.001401
Name: age, Length: 88, dtype: float64

In [ ]:
age.value_counts(sort=True,ascending=False,dropna=False,bins=5) #categorizes...

(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: age, dtype: int64

In [ ]:
age.value_counts(sort=True,ascending=False,dropna=False,bins=10) #categorizes...

(16.336, 24.294]    177
(24.294, 32.252]    169
(32.252, 40.21]     118
(40.21, 48.168]      70
(0.339, 8.378]       54
(8.378, 16.336]      46
(48.168, 56.126]     45
(56.126, 64.084]     24
(64.084, 72.042]      9
(72.042, 80.0]        2
Name: age, dtype: int64

## Analyzing non-numerical series [string based column]

In [ ]:
city=summer['City']

In [ ]:
city.head(2),city.shape

(Medal_No1    Athens
 Medal_No2    Athens
 Name: City, dtype: object,
 (31165,))

In [ ]:
city.describe()

count      31165
unique        22
top       London
freq        3567
Name: City, dtype: object

In [ ]:
city.count()

31165

In [ ]:
city.unique(),len(city.unique())

(array(['Athens', 'Paris', 'St Louis', 'London', 'Stockholm', 'Antwerp',
        'Amsterdam', 'Los Angeles', 'Berlin', 'Helsinki',
        'Melbourne / Stockholm', 'Rome', 'Tokyo', 'Mexico', 'Munich',
        'Montreal', 'Moscow', 'Seoul', 'Barcelona', 'Atlanta', 'Sydney',
        'Beijing'], dtype=object),
 22)

In [ ]:
city.nunique()

22

In [ ]:
city.value_counts()

London                   3567
Athens                   2149
Los Angeles              2074
Beijing                  2042
Sydney                   2015
Atlanta                  1859
Barcelona                1705
Seoul                    1546
Paris                    1396
Moscow                   1387
Montreal                 1305
Antwerp                  1298
Munich                   1185
Mexico                   1031
Tokyo                    1010
Helsinki                  889
Melbourne / Stockholm     885
Stockholm                 885
Rome                      882
Berlin                    875
Amsterdam                 710
St Louis                  470
Name: City, dtype: int64

In [ ]:
city.value_counts(sort=True,ascending=False,dropna=True,normalize=True) #bins only work with numeric data

London                   0.114455
Athens                   0.068956
Los Angeles              0.066549
Beijing                  0.065522
Sydney                   0.064656
Atlanta                  0.059650
Barcelona                0.054709
Seoul                    0.049607
Paris                    0.044794
Moscow                   0.044505
Montreal                 0.041874
Antwerp                  0.041649
Munich                   0.038023
Mexico                   0.033082
Tokyo                    0.032408
Helsinki                 0.028526
Melbourne / Stockholm    0.028397
Stockholm                0.028397
Rome                     0.028301
Berlin                   0.028076
Amsterdam                0.022782
St Louis                 0.015081
Name: City, dtype: float64

# Creating Series

In [ ]:
# from dataframe
summer['City']

Medal_No1        Athens
Medal_No2        Athens
Medal_No3        Athens
Medal_No4        Athens
Medal_No5        Athens
                  ...
Medal_No31161    London
Medal_No31162    London
Medal_No31163    London
Medal_No31164    London
Medal_No31165    London
Name: City, Length: 31165, dtype: object

In [ ]:
#importing from CSV
# pd.read_csv('summer.csv',usecols=['City']) #it returns a dataframe..adding squeeze=True -> makes series
pd.read_csv('summer.csv',usecols=['City'],squeeze=True)

0        Athens
1        Athens
2        Athens
3        Athens
4        Athens
          ...
31160    London
31161    London
31162    London
31163    London
31164    London
Name: City, Length: 31165, dtype: object

In [ ]:
#creating from lists
pd.Series([11,12,13,14,15])

0    11
1    12
2    13
3    14
4    15
dtype: int64

In [ ]:
pd.Series([10,25,6,36,2], index=["Mon","Tue","Wed","Thu", "Fri"], name = "Sales")

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
Name: Sales, dtype: int64

In [ ]:
import numpy as np
pd.Series(np.array([10,25,6,36,2]))

0    10
1    25
2     6
3    36
4     2
dtype: int32

In [ ]:
dic={"Mon":10, "Tue":25, "Wed":6, "Thu": 36, "Fri": 2}
pd.Series(dic)

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [ ]:
pd.Series(dic,index=[1,2,3,'Thu','Fri'])  #with new indexes, it will append if finds else append NaN

1       NaN
2       NaN
3       NaN
Thu    36.0
Fri     2.0
dtype: float64

## Indexing and slicing

In [ ]:
data.reset_index(inplace=True)
data.head()
age=data['age']

In [ ]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [ ]:
age[0],age[2:5],age[[2,3,4]]

(22.0,
 2    26.0
 3    35.0
 4    35.0
 Name: age, dtype: float64,
 2    26.0
 3    35.0
 4    35.0
 Name: age, dtype: float64)

In [ ]:
age[-1] # For rangeIndex, -ve indexing doesn't work

KeyError: -1

In [ ]:
#solution
age.iloc[-1]

32.0

In [ ]:
event=summer['Event'].copy()

In [ ]:
event.head()

Medal_No1                100M Freestyle
Medal_No2                100M Freestyle
Medal_No3    100M Freestyle For Sailors
Medal_No4    100M Freestyle For Sailors
Medal_No5    100M Freestyle For Sailors
Name: Event, dtype: object

In [ ]:
event[:'Medal_No4']

Medal_No1                100M Freestyle
Medal_No2                100M Freestyle
Medal_No3    100M Freestyle For Sailors
Medal_No4    100M Freestyle For Sailors
Name: Event, dtype: object

In [ ]:
event.loc[:'Medal_No4']

Medal_No1                100M Freestyle
Medal_No2                100M Freestyle
Medal_No3    100M Freestyle For Sailors
Medal_No4    100M Freestyle For Sailors
Name: Event, dtype: object

In [ ]:
event.iloc[:4]

Medal_No1                100M Freestyle
Medal_No2                100M Freestyle
Medal_No3    100M Freestyle For Sailors
Medal_No4    100M Freestyle For Sailors
Name: Event, dtype: object

In [ ]:
event[['Medal_No2','Medal_No5']]

Medal_No2                100M Freestyle
Medal_No5    100M Freestyle For Sailors
Name: Event, dtype: object

# Sorting

In [ ]:
age.sort_index(ascending=False,inplace=True,na_position='first')  #sorting the indexes

In [ ]:
age

890    32.0
889    26.0
888     NaN
887    19.0
886    27.0
       ...
4      35.0
3      35.0
2      26.0
1      38.0
0      22.0
Name: age, Length: 891, dtype: float64

In [ ]:
event.sort_values(ascending=True,inplace=True,na_position='first')

In [ ]:
event

Medal_No30591                       + 100KG
Medal_No30590                       + 100KG
Medal_No30589                       + 100KG
Medal_No30588                       + 100KG
Medal_No24586         + 100KG (Heavyweight)
                            ...
Medal_No363      Épée, Amateurs And Masters
Medal_No362      Épée, Amateurs And Masters
Medal_No364                   Épée, Masters
Medal_No365                   Épée, Masters
Medal_No366                   Épée, Masters
Name: Event, Length: 31165, dtype: object

## nlargest and nsmallest

returns n max or min numbers

In [ ]:
age.nlargest(3)

630    80.0
851    74.0
493    71.0
Name: age, dtype: float64

In [ ]:
age.nsmallest(3)

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [ ]:
type(age.nsmallest(3))

pandas.core.series.Series

## idxmin and idxmax

In [ ]:
age.idxmin()

803

In [ ]:
age.idxmax()

630

In [ ]:
age.loc[age.idxmin()] #combining loc and idxmin

0.42

## Manipulating the Series

In [ ]:
sales = pd.Series([10,25,6,36,2,0,None,5], index = ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun", "Mon"])
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     NaN
Mon     5.0
dtype: float64

In [ ]:
sales["Sun"] = 0  #changing the value
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     0.0
Mon     5.0
dtype: float64

In [ ]:
sales.iloc[3]=100

In [ ]:
sales

Mon     10.0
Tue     25.0
Wed      6.0
Thu    100.0
Fri      2.0
Sat      0.0
Sun      0.0
Mon      5.0
dtype: float64

In [ ]:
(sales/1.1).round(2)

Mon     9.09
Tue    22.73
Wed     5.45
Thu    90.91
Fri     1.82
Sat     0.00
Sun     0.00
Mon     4.55
dtype: float64